cavity45/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;


// ****************************************************************************
// *** This is where we modify our geometry in order to rotate 45 degress.  ***
// ****************************************************************************
//
// |->	x_new = x * cos(theta) - y * sin(theta)
// |->	y_new = x * sin(theta) + y * cos(theta)
// |->	z_new = z_old
//


vertices
(
    (0 0 0)                // Vertex 0 (same)
    (0.7071 0.7071 0)      // Vertex 1 (rotated)
    (0 1.4142 0)           // Vertex 2 (rotated)
    (-0.7071 0.7071 0)     // Vertex 3 (rotated)
    (0 0 1)                // Vertex 4 (same)
    (0.7071 0.7071 1)      // Vertex 5 (rotated)
    (0 1.4142 1)           // Vertex 6 (rotated)
    (-0.7071 0.7071 1)     // Vertex 7 (rotated)
);
// ****************************************************************************

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
